<?php
$str = <<<EOF
一、启 请
《大佛顶首楞严神咒》启请法

大兴 善 寺三 藏 沙 门 大 广 不 空 奉 诏 译
稽首 光明大佛顶 如来万行首楞严
开无相门圆寂宗 字字观照金刚定
瑜伽妙旨 传 心印 摩诃衍行总持王
说此秘密悉怛多
解脱法身金刚句
菩提力大虚空量
三昧智印海无边
不持斋者是持斋
不持戒者名持戒
八万四千金刚众 行住坐卧每随身
十方法界诸如来 护念加威受持者
念满一万八千遍 遍遍入于无相定
号称坚固金刚幢 自在得名人胜佛
纵使骂詈不为过 诸天常闻说法声
神通变化不思议 陀罗尼门最第一
大圣放光佛顶力 掩恶扬善证菩提

《大佛顶首楞严神咒》
唯闻念者薝葡香 不嗅一切余香气
僧破二百五十戒 比丘尼犯八波罗
闻念佛顶大明王 还得具足声闻戒
若人杀害 怨 家 众
常 行十恶罪无边
暂闻灌顶不思议
恒沙罪障皆消灭
现受阿鼻大地狱
镬汤炉炭黑绳人
若发菩提片善心
一闻永得生天道
我今依经说偈颂
无量功德普庄严
听者念者得总持
同获涅槃寂灭乐
-2-

 《大佛顶首楞严神咒》
二、诵 咒
南无楞严会 上 佛菩萨(三 称 )
妙湛总持不动尊 首楞严王世希有
销我亿劫颠倒想 不历僧祇获法身
愿今得果成宝王 还度如是恒沙众
将此深心奉尘刹 是则名为报佛恩
伏请世尊为 证 明 五浊恶世誓先入
如一众 生未成佛 终不于此取泥洹
大 雄 大力大慈悲
希更 审除微细惑
令我早登无上觉
于十方界坐道场
舜若多性可销亡 烁迦罗心无动转
南无 常 住十方佛
南无 常 住十方法
南无 常 住十方僧
南无释迦牟尼佛
南无佛顶首楞严
南无观世音菩萨
南无金刚 藏菩萨
-3-

 《大佛顶首楞严神咒》
尔时世尊，从肉髻中，涌百宝光。光 中
涌 出 ，千 叶 宝 莲 。有 化 如 来 ，坐 宝 华 中 。顶 放
十道，百宝 光 明。一一 光 明，皆遍示现，十
恒 河 沙 金 刚 密 迹 ，擎 山 持 杵 ，遍 虚 空 界 。大 众
仰 观 ，畏爱兼抱。求佛哀佑，一心听佛，无见
顶 相 放 光 如来 宣 说 神 咒 。
第一会
南无萨怛他.苏伽多耶.阿啰诃帝.三 藐 三菩陀写。
萨怛他.佛陀俱胝.瑟尼 钐 。
南无萨婆.勃陀勃地.萨跢鞞弊。南无萨多南.三
藐 三菩陀.俱知喃。娑舍啰婆迦. 僧 伽喃。
南无卢鸡.阿罗汉.跢喃。南无苏卢.多波那喃。南
无娑羯唎陀.伽弥喃。
喃。
南无提婆离瑟赧。南无悉陀耶.毗地耶.陀啰离瑟 nǎn shě bō nú jiē là hē suō hē suō là mótuōnán 赧。舍波奴.揭啰诃.娑诃娑啰.摩他喃。
南ná 无mó 跋bá 啰là 诃hē 摩mó 尼ní 。南ná 无mó 因yīn 陀tuó 啰là 耶yē 。 -4-
南无卢鸡三 藐 伽哆喃。三 藐 伽波啰.底波多那 nán
námó tí pó lí sěinǎn námó xī tuóyē pí dì yē tuó là lí sěi

 《大佛顶首楞严神咒》
南ná无mó婆pó伽qié婆pó帝dì 。卢lú 陀tuó啰là 耶yē。乌wū摩mó般bō帝dì 。娑suō醯xī 夜yè耶yē。
 ná mó pó qié pó dì nuó là yě ná yē pánzhēmó hē sānmùtuó là
南无婆伽婆帝。那啰野拏耶。槃遮摩诃.三慕陀啰。 námó xī jié lì duōyē
南无悉羯唎多耶。
námópóqiépó dì móhē jiā là yē dì lì bō lānuóqié là
南无婆伽婆帝。摩诃迦啰耶。地唎般剌那伽啰。
pítuólà bōnájiā là yē ā dìmùdì shīmóshěnuóní pó xī
毗陀啰.波拏迦啰耶。阿地目帝。尸摩舍那泥.婆悉 ní módá lì qiéná námó xī jié lì duōyē
泥。摩怛唎伽拏。南无悉羯唎多耶。
ná mó pó qié pó dì duōtuōqiéduō jù là yē ná mó bō tóumó
南无婆伽婆帝。多他伽跢.俱啰耶。南无般头摩. 俱jù 啰là 耶yē 。南ná 无mó跋bá 阇shé啰là .俱jù 啰là 耶yē 。南ná 无mó摩mó尼ní .俱jù 啰là 耶yē 。
南n á 无m ó 伽q i é 阇s h é . 俱j ù 啰l à 耶y ē 。
námópóqiépó dì dì lì cháshūlà xīnuó bō là hē là ná là
南无婆伽婆帝。帝唎茶.输啰西那。波啰诃啰.拏啰
shé yē duò tuō qié duō yē
阇耶。跢他伽多耶。
námópóqiépó dì námó ā míduōpó yē duòtuōqiéduōyē
南无婆伽婆帝。南无阿弥多婆耶。跢他伽多耶。
ā là hē dì sānmiǎosān pú tuó yē
阿啰诃帝。三 藐 三菩陀耶。
námópóqiépó dì ā chúpí yē duòtuōqiéduōyē ā là hē
南无婆伽婆帝。阿刍鞞耶。跢他伽多耶。阿啰诃
dì sānmiǎosān pú tuó yē
帝。三 藐 三菩陀耶。
南ná 无mó 婆pó 伽qié 婆pó 帝dì 。鞞pí 沙shā 阇shé 耶yē 。俱jù 嚧lú 吠fèi 柱zhù 唎lì 耶yē 。般bō 啰là
pó làshéyē duòtuōqiéduōyē
婆啰阇耶。跢他伽多耶。
námópóqiépó dì sānbǔshī bìduō sàliánnà là lāshéyē
南无婆伽婆帝。三补师毖多。萨怜捺啰.剌阇耶。
duòtuō qiéduō yē ā là hē dì sānmiǎosān pú tuó yē
跢他伽多耶。阿啰诃帝。三 藐 三菩陀耶。
-5-

 啰诃帝。三 藐 三菩陀耶。
《大佛顶首楞严神咒》
 námópóqiépó dì shě jī yě mǔnuóyè duòtuōqiéduōyē ā
南无婆伽婆帝。舍鸡野.母那曳。跢他伽多耶。阿
là hē dì sānmiǎosān pú tuó yē
námópóqiépó dì lā dánuó jī dū là shéyē duòtuōqiéduōyē
南无婆伽婆帝。剌怛那.鸡都啰阇耶。跢他伽多耶。 ā là hē dì sānmiǎosān pú tuó yē
阿啰诃帝。三 藐 三菩陀耶。
dìpiáo námósà jié lì duō yì tán póqiépóduō sà dátuō qié
帝 瓢 .南无萨羯唎多。翳昙.婆伽婆多。萨怛他.伽 dū sěi ní shān sà dá duō bō dá lán ná mó ā pó là shì dān
都瑟尼 钐 。萨怛多.般怛嚂。南无阿婆啰视躭。 bō là dì yáng qí là
般啰帝. 扬 歧啰。
sà là pó bùduōjiē là hē ní jiē là hē jié jiā là hē ní bá là
萨啰婆.部多揭啰诃。尼揭啰诃.羯迦啰诃尼。跋啰. bì dì yē chìtuó nǐ ā jiā là mì lì zhù bō lì dá là yē níng 毖地耶.叱陀你。阿迦啰.密唎柱。般唎.怛啰耶. 儜
揭j i ē 唎l ì 。
sà là pó pántuónuó mùchā ní sà là pó tù sěi zhā
萨啰婆.槃陀那.目叉尼。萨啰婆.突瑟吒
tù xī fá bōnuónǐ fá là ní zhědū là shī dìnán jié là hē
突悉乏.般那你。伐啰尼。赭都啰.失帝南。羯啰诃. 娑s u ō 诃h ē 萨s à 啰l à 若r u ò 阇s h é 。
pí duōbēng suōnuó jié lì ā sěi zhābìng shě dì nán nuóchāchà
毗多 崩 .娑那羯唎。阿瑟吒冰。舍帝南。那叉剎 dá là ruòshé bō là sà tuó nuójié lì ā sěizhānán móhē jiē 怛啰.若阇。波啰萨陀.那羯唎。阿瑟吒南。摩诃揭
啰l à 诃h ē . 若r u ò 阇s h é 。
pí duōbēng sà nuó jié lì sà pó shědōu lú nǐ pó là ruò shé
毗多 崩 .萨那羯唎。萨婆.舍都嚧。你婆啰若阇。 hū lán tù xī fá nánzhēnuóshě ní bì shāshě xī dá là
呼蓝.突悉乏.难遮那舍尼。毖沙舍.悉怛啰。
ā jí ní wūtuójiā là ruòshé ā bō là shìduōjù là
阿吉尼.乌陀迦啰.若阇。阿般啰视多具啰。 -6-

 《大佛顶首楞严神咒》
 mó hē bō là zhànchí mó hē diéduō mó hē dì shé mó hē shuìduō
摩诃般啰 战 持。摩诃叠多。摩诃帝阇。摩诃税多.
shé pó là mó hē bá là pántuó là pó xī nǐ ā lì yē duō là
阇婆啰。摩诃跋啰.槃陀啰.婆悉你。阿唎耶多啰。 毗p í 唎l ì 俱j ù 知z h ī 。 誓s h ì 婆p ó 毗p í 阇s h é 耶y ē 。
bá shé là mó lǐ dǐ pí shě lú duō bó téngwǎng jiā
跋阇啰.摩礼底。毗舍嚧多。勃腾 罔 迦。
báshé là zhì hènuó ā zhē mó là zhì pó bō là zhìduō
跋阇啰.制喝那.阿遮。摩啰制婆.般啰质多。
bá shé là shàn chí pí shě là zhē shànduōshě pí tí pó bǔ shì duō
跋阇啰. 擅 持。毗舍啰遮。扇 多舍.鞞提婆.补视多。 sū mó lú bō mó hē shuìduō ā lì yē duō là mó hē pó là ā
苏摩嚧波。摩诃税多。阿唎耶多啰。摩诃婆啰.阿 般b ō 啰l à 。
báshé là shāngjiē là zhì pó báshé là jù mó lì jù lántuó lì
跋阇啰. 商 揭啰.制婆。跋阇啰.俱摩唎。俱蓝陀唎。 bá shé là hē sà duōzhē pí dì yē qiánzhēnuó mó lì jiā kù sū
跋阇啰.喝萨多遮。毗地耶. 乾 遮那.摩唎迦。啒苏
mǔ pójié làduōnuó pí lúzhēnuó jù lì yē yè là tù sěi ní
母.婆羯啰多那。鞞嚧遮那.俱唎耶。夜啰菟.瑟尼 shān pí zhé lán pó mó ní zhē
钐 。毗折蓝.婆摩尼遮。
báshé là jiānuó jiā bō là pó lú shénuó báshé là dùnzhìzhē
跋阇啰.迦那.迦波啰婆.嚧阇那.跋阇啰.顿稚遮。
shuìduōzhē jiā mó là chàshē shī bō là pó yì dì yí dì mǔ
税多遮.迦摩啰。剎奢尸.波啰婆。翳帝夷帝。母 tuó là jié ná suō pí là chàn juéfàn dū yìn tù nuó mómó xiě
陀啰羯拏。娑鞞啰 忏 。掘梵都。印兔那.么么写。 第dì 二èr 会huì
wū xìn lì sè jiē ná bō lā shě xī duō sà dá tuō qié dū sěi ní
乌昕。唎瑟揭拏。般剌.舍悉多。萨怛他.伽都瑟尼 shān
钐。
-7-

 hǔ xìn dū lú yōng zhān pó nuó
虎昕。都卢雍。瞻婆那。
hǔ xìn dū lú yōng xī dānpónuó
虎昕。都卢 雍 。悉耽婆那。
《大佛顶首楞严神咒》
 hǔ xìn dū lú yōng bō là sěi dì yē sānbōchā ná jié là
虎昕。都卢 雍 。波啰瑟地耶.三般叉.拏羯啰。 hǔ xìn dū lú yōng sà pó yàochā jiē là chàsuō jiē là hē ruò
虎昕。都卢雍。萨婆药叉.喝啰剎娑。揭啰诃.若
shé pí téngbēng sà nuó jié là
阇。毗腾 崩.萨那羯啰。
hǔ xìn dū lú yōng zhě dū là shī dǐ nán jiē là hē suō hē sà
虎昕。都卢 雍 。者都啰.尸底南。揭啰诃.娑诃萨 là nán pí téngbēng sà nuó là
啰南 毗腾崩.萨那啰。
hǔxìn dū lúyōng làchā póqiéfàn sàdátuō qiédūsěi
虎昕。都卢 雍 。啰叉。婆伽梵。萨怛他.伽都瑟 ní shān bō là diǎn shé jí lì
尼钐。波啰点.阇吉唎。
摩mó诃hē 娑suō诃hē 萨sà 啰là 。勃bó 树shù.娑suō诃hē 萨sà 啰là .室shì 唎lì 沙shā。俱jù 知zhī .娑suō
hē sà ní dì lì ā bì tí shì pó lì duō zhāzhāyīngjiā
诃萨泥.帝隶。阿弊提视.婆唎多。吒吒罂迦。 mó hē bá shé lú tuó là dì lì pú pó nuó mànchá là
摩诃.跋阇嚧陀啰。帝唎.菩婆那。 曼 茶啰。 wū xìn suō xī dì bó pó dū mómó yìn tù nuó mómóxiě
乌昕。娑悉帝.薄婆都。么么。印兔那.么么写。 第dì 三sān会huì
啰là 阇shé 婆pó 夜yè 。主zhǔ 啰là 跋bá 夜yè 。阿ā 祇qì 尼ní .婆pó 夜yè 。乌wū 陀tuó 迦jiā .婆pó 夜yè 。
píshā póyè shěsàduōlà póyè pó là zhuójié là póyè
毗沙.婆夜。舍萨多啰.婆夜。婆啰. 斫 羯啰.婆夜。 tū sěi chā pó yè ā shě nǐ pó yè ā jiā là mì lì zhù pó yè
突瑟叉.婆夜。阿舍你婆夜。阿迦啰.密唎柱.婆夜。
tuó là ní bù míjiàn bōqiébōtuó pó yè wū là jiā póduōpó yè
陀啰尼.部弥剑.波伽波陀.婆夜。乌啰迦.婆多婆夜。 -8-

 《大佛顶首楞严神咒》
剌阇坛茶.婆夜。那伽婆夜。毗条怛.婆夜。苏波啰 拏ná .婆pó 夜yè 。
药叉.揭啰诃。啰叉私.揭啰诃。毕唎多.揭啰诃。 pí shězhē jiē là hē bù duō jiē là hē jiū pánchá jiē là hē
毗 舍 遮 . 揭 啰 诃 。部 多 。揭 啰 诃 。鸠 槃 茶 . 揭 啰 诃 。
补 丹 那 . 揭 啰 诃 。迦 吒 补 单 那 . 揭 啰 诃 。悉 乾 度 . 揭 là hē ā bō xī mó là jiē là hē wūtánmótuó jiē là hē chē 啰诃。阿播悉摩啰.揭啰诃。乌檀摩陀.揭啰诃。车
yè jiē là hē xī lì pó dì jiē là hē
夜揭啰诃。醯唎婆帝.揭啰诃。
社多.诃唎南。揭婆诃.唎南。嚧地啰.诃唎南。忙 suō hē lì nán mí tuó hē lì nán móshéhē lì nán shéduō hē
娑.诃唎南。谜陀.诃唎南。摩阇诃唎南。阇多.诃 lì nǚ shì bǐduō hē lì nán píduō hē lì nán póduō hē lì
唎女。视比多.诃唎南。毗多.诃唎南。婆多.诃唎
南。阿输遮.诃唎女。质多.诃唎女。帝 钐 萨鞞 钐 。 sà pó jiē là hēnán
萨婆.揭啰诃南。
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。波唎.跋啰.者迦.
讫唎担。
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。茶演尼.讫唎担。 pítuóyēshéchēntuóyèmí jī là yèmí móhēbōshū bōdá
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。摩诃般输.般怛
夜。嚧陀啰.讫唎担。
担。
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。那啰夜拏.讫唎 dān
-9-

 《大佛顶首楞严神咒》
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。怛埵伽嚧.茶西.
qì lì dān
讫唎担。
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。摩诃迦啰.摩怛 lì qié ná qì lì dān
唎伽拏.讫唎担。
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。迦波唎迦.讫唎 dān
担。
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。阇耶羯啰.摩度
羯啰。萨婆.啰他.娑达那.讫唎担。
讫唎担。
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。毗唎 羊 .讫唎知。 nántuó jī shā là qié ná bō dì suǒ xī yè qì lì dān 难陀.鸡沙啰.伽.拏般帝。索醯夜.讫唎担。
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。赭咄啰.婆耆你. qì lì dān
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。那揭那.舍啰.婆
拏.讫唎担。
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。阿罗汉.讫唎担。 pítuóyēshéchēntuóyèmí jī là yèmí píduōlàqié qì lì
毗陀夜阇.嗔陀夜弥。鸡啰夜弥。毗多啰伽.讫唎
dān
担。
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。跋阇啰波你。
具醯夜.具醯夜。迦地.般帝.讫唎担。 - 10 -

 《大佛顶首楞严神咒》
毗陀夜阇. 嗔 陀夜弥。鸡啰夜弥。啰叉 罔 。婆伽 fàn yìn tù nuó mó mó xiě
梵。印兔那.么么写。
第dì 四sì 会huì
婆伽梵。萨怛多.般怛啰。南无粹都帝。阿悉多. nuólà lā jiā bō là pó xī pǔzhā 那啰剌迦。波啰婆.悉普吒。
毗迦.萨怛多.钵帝唎。什佛啰.什佛啰。陀啰陀啰。
频陀啰.频陀啰. 嗔 陀 嗔 陀。
虎昕。虎昕。泮吒。泮吒.泮吒.泮吒.泮吒。娑诃。 xī xī pàn ā móujiā yēpàn ā bō là tí hēduōpàn pó là
醯醯泮。阿牟迦耶泮。阿波啰.提诃多泮。婆啰.
波啰陀泮。阿素啰.毗陀啰.波迦泮。
萨婆.提鞞.弊泮。萨婆.那伽.弊泮。萨婆.药叉.弊 pàn sà pó qián tà pó bì pàn sà pó bǔdānnuó bì pàn jiā zhā
泮 。萨 婆 . 乾 闼 婆 . 弊 泮 。萨 婆 . 补 丹 那 弊 泮 。迦 吒 .
补丹那.弊泮。
萨婆.突狼枳帝.弊泮。萨婆.突涩比犁.讫瑟帝.弊 pàn
泮。
萨婆.什婆唎.弊泮。萨婆.阿播悉摩犁.弊泮。萨婆. shělà póná bìpàn sàpó dì dì jī bìpàn
舍啰.婆拏.弊泮。萨婆.地帝鸡.弊泮。
萨婆.怛摩陀继.弊泮。萨婆.毗陀耶.啰誓.遮犁.弊 - 11 -

 《大佛顶首楞严神咒》
泮。阇夜羯啰.摩度羯啰.萨婆.啰他.娑陀鸡.弊泮。
毗地夜.遮唎.弊泮。者都啰.缚耆你.弊泮。跋阇啰. jù mó lì pí tuóyè là shì bìpàn
俱摩唎。毗陀夜.啰誓.弊泮。
摩诃波啰. 丁 羊 .乂耆唎.弊泮。跋阇啰. 商 羯啰
夜。波啰 丈 耆.啰阇耶泮。
摩诃迦啰夜。摩诃.末怛唎迦拏。南无.娑羯唎多. yèpàn bì sěiná bì yèpàn bó là hē móuní yèpàn ā qí
夜泮。毖瑟拏婢.曳泮。勃啰诃. 牟 尼.曳泮。阿耆
尼.曳泮。
摩诃羯唎.曳泮。羯啰檀迟.曳泮。蔑怛唎.曳泮。 láo dá lì yè pàn zhēwénchá yè pàn jié luó là dá lì yè pàn
唠 怛 唎 . 曳 泮 。遮 文 茶 . 曳 泮 。羯 逻 啰 怛 唎 . 曳 泮 。
迦般唎.曳泮。阿地目.质多.迦尸摩.舍那。婆私你. yè pàn
曳泮。
演吉质.萨埵.婆写.么么.印兔那.么么写. 第dì 五wǔ会huì
突瑟吒.质多。阿末怛唎.质多。
乌wū 阇shé .诃hē 啰là 。伽qié 婆pó .诃hē 啰là 。嚧lú 地dì .啰là 诃hē 啰là 。婆pó 娑suō .诃hē 啰là 。
摩阇.诃啰。阇多.诃啰。视毖多.诃啰。跋略夜.诃
啰。乾 陀.诃啰。布史波.诃啰。颇啰.诃啰。婆写. - 12 -

 《大佛顶首楞严神咒》
 诃h ē 啰l à 。
般波.质多。突瑟吒.质多。唠陀啰.质多。
毗舍遮.揭啰诃。部多.揭啰诃。鸠槃茶.揭啰诃。
悉 乾 陀.揭啰诃。
乌怛摩陀.揭啰诃。车夜.揭啰诃。阿播萨摩啰.揭 là hē zháiqūgé cháqí ní jiē là hē lì fó dì jiē là hē
啰诃。宅袪革.茶耆尼.揭啰诃。唎佛帝.揭啰诃。 阇s h é 弥m í 迦j i ā . 揭j i ē 啰l à 诃h ē 。
舍俱尼.揭啰诃。姥陀啰.难地迦.揭啰诃。阿蓝婆. jiē là hē qiándù bō ní jiē là hē
揭啰诃。 乾 度波尼.揭啰诃
什伐啰。堙迦醯迦。坠帝药迦。怛隶帝药迦。者
突托迦。尼提.什伐啰。毖 钐 摩.什伐啰。薄底迦。 鼻bí 底dǐ 迦jiā 。室shì 隶lì .瑟sěi 蜜mì 迦jiā 。娑suō你nǐ .般bō 帝dì 迦jiā 。萨sà 婆pó .什shí 伐fá
啰l à 。
室嚧吉帝。末陀.鞞达.嚧制剑。阿绮嚧 钳 。目佉 lú qián jié lì tū lú qián
嚧钳。羯唎突嚧钳。
揭 啰 诃 . 揭 蓝 。羯 拏 . 输 蓝 。惮 多 . 输 蓝 。迄 唎 夜 . 输 蓝lán。末mò么mò.输shū蓝lán。跋bá唎lì 室shì婆pó.输shū蓝lán。毖bì 栗lì 瑟sěi吒zhā.输shū蓝lán。
乌wū陀tuó啰là .输shū蓝lán。
- 13 -

《大佛顶首楞严神咒》
羯知输蓝。跋悉帝输蓝。邬嚧输蓝。常 伽输蓝。
喝悉多.输蓝。跋陀输蓝。娑 房 盎 伽.般啰 丈 伽 输s h ū 蓝l á n 。
部 多 . 毖 哆 茶 。茶 耆 尼 。什 婆 啰 。陀 突 嚧 迦 。建 咄
嚧吉知。婆路多毗。萨般嚧.诃凌伽。输沙怛啰。 suōnuójiélà píshāyùjiā āqíníwūtuójiā mòlà pílà
娑那羯啰。毗沙喻迦。阿耆尼.乌陀迦。末啰.鞞啰. jiànduò là ā jiā là mì lì duō dá liǎn bù jiā dì lì lā zhā
建跢啰。阿迦啰.蜜唎咄。怛敛部迦。地栗剌吒。
毖唎瑟质迦。萨婆那俱啰。肆引伽弊.揭啰唎药叉. dá là chú
怛啰刍。
末啰视.吠帝 钐 .娑鞞 钐 。悉怛多.钵怛啰。摩诃跋
阇嚧.瑟尼 钐 。
摩诃般赖. 丈 耆蓝。夜波突陀.舍喻阇那。辫怛隶 拏n á 。
毗陀耶.槃昙迦嚧弥。帝殊.槃昙迦嚧弥。般啰毗 tuó pán tán jiā lú mí
陀.槃昙迦嚧弥。
哆侄他。唵。阿那隶。毗舍提。鞞啰.跋阇啰.陀唎。
槃陀槃陀你。跋阇啰. 谤 尼泮。虎昕。都嚧 瓮 泮。 莎s u ō 婆p ó 诃h ē 。
- 14 -

《大佛顶首楞严神咒》
三、回向偈
上来现前清净众 讽诵楞严秘密咒
回向三宝众龙天 守护正法诸圣 众
三涂八难俱离苦 四恩三有尽沾恩
国界安宁兵戈消 风调雨顺民安乐
大众薰修希胜进 十地顿超无难事
三门清净绝非虞 众等增益增福慧
祈愿法界 众 生 离苦得乐，究竟 成 佛。
EOF;
$ar = mb_str_split($str);
echo json_encode($ar, JSON_UNESCAPED_UNICODE);
