<?php
$str = <<<EOF
楞严咒

南无楞严会上佛菩萨

妙湛总持不动尊　首楞严王世希有　销我亿劫颠倒想　不历僧祇获法身　愿今得果成宝王　还度如是恒沙众
将此深心奉尘刹　是则名为报佛恩　伏请世尊为证明　五浊恶世誓先入　如一众生未成佛　终不于此取泥洹
大雄大力大慈悲　希更审除微细惑　令我早登无上觉　于十方界坐道场　舜若多性可销亡　烁迦罗心无动转
南无常住十方佛　南无常住十方法　南无常住十方僧
南无释迦牟尼佛　南无佛顶首楞严　南无观世音菩萨　南无金刚藏菩萨
尔时世尊，从肉髻中，涌百宝光。光中涌出，千叶宝莲。有化如来，坐宝华中。顶放十道，百宝光明。
一一光明，皆遍示现，十恒河沙，金刚密迹，擎山持杵，遍虚空界。大众仰观，畏爱兼抱。求佛哀佑，
一心听佛，无见顶相，放光如来，宣说神咒。

第一会
南无萨怛他.苏伽多耶.阿啰诃帝.三藐三菩陀写　南无萨怛他　佛陀俱胝瑟尼钐
南无萨婆.勃陀勃地.萨跢鞞弊　南无萨多南.三藐三菩陀.俱知喃　娑舍啰婆迦.
僧伽喃　南无卢鸡阿罗汉跢喃　南无苏卢多波那喃　南无娑羯唎陀伽弥喃
南无卢鸡三藐伽哆喃　三藐伽波啰.底 波多那喃　南无提婆离瑟赧　南无悉陀耶.
毗地耶.陀啰离瑟赧　舍波奴.揭啰诃.娑诃娑啰摩他喃　南无跋啰诃摩尼
南无因陀啰耶　南无婆伽婆帝　卢陀啰耶　乌摩般帝　娑醯夜耶　南无婆伽婆帝
那啰野拏耶　盘遮摩诃.三慕陀啰　南无悉羯唎多耶　南无婆伽婆帝 摩诃迦啰耶
地唎般剌那伽啰　毗陀啰.波拏迦啰耶　阿地目帝　尸摩舍那泥.婆悉泥
摩怛唎伽拏　南无悉羯唎多耶　南无婆伽婆帝　多他伽跢俱啰耶　南无般头摩.
俱啰耶　南无跋阇啰.俱啰耶　南无摩尼俱啰耶　南无伽阇俱啰耶
南无婆伽婆帝　帝唎茶.输啰西那　波啰诃啰拏啰阇耶　跢他伽多耶
南无婆伽婆帝　南无阿弥多婆耶　跢他伽多耶　阿啰诃帝　三藐三菩陀耶
南无婆伽婆帝　阿刍鞞耶　跢他伽多耶 阿啰诃帝 三藐三菩陀耶　南无婆伽婆帝
鞞沙阇耶　俱嚧吠柱唎耶　般啰婆啰阇耶　跢他伽多耶　南无婆伽婆帝
三补师毖多　萨怜捺啰.剌阇耶　跢他伽多耶　阿啰诃帝　三藐三菩陀耶
南无婆伽婆帝　舍鸡野.母那曳　跢他伽多耶　阿啰诃帝　三藐三菩陀耶
南无婆伽婆帝　剌怛那.鸡都啰阇耶　跢他伽多耶　阿啰诃帝　三藐三菩陀耶
帝瓢.南无萨羯唎多　翳昙婆伽婆多　萨怛他.伽都瑟尼钐　萨怛多.般怛嚂
南无阿婆啰视躭　般啰帝.扬歧啰　萨啰婆部多.揭啰诃　尼揭啰诃.羯迦啰诃尼
跋啰毖地耶.叱陀你　阿迦啰密唎柱 般唎怛啰耶.儜揭唎 萨啰婆.盘陀那.目叉尼
萨啰婆.突瑟咤　突悉乏.般那你 伐啰尼　赭都啰失帝南　羯啰诃.娑诃萨啰若阇
毗多崩.娑那羯唎　阿瑟咤冰　舍帝南　那叉剎怛啰若阇　波啰萨陀那羯唎
阿瑟咤南　摩诃揭啰诃若阇　毗多崩.萨那羯唎　萨婆舍都嚧　你婆啰若阇
呼蓝突悉乏.难遮那舍尼　毖沙舍.悉怛啰　阿吉尼.乌陀迦啰若阇
阿般啰视多具啰　摩诃般啰战持　摩诃迭多　摩诃帝阇　摩诃税多阇婆啰
摩诃跋啰盘陀啰.婆悉你　阿唎耶多啰　毗唎俱知　誓婆毗阇耶　跋阇啰.摩礼底
毗舍嚧多　勃腾罔迦　跋阇啰.制喝那阿遮　摩啰制婆.般啰质多　跋阇啰擅持
毗舍啰遮　扇多舍.鞞提婆.补视多　苏摩嚧波　摩诃税多　阿唎耶多啰　摩诃
婆啰阿般啰　跋阇啰.商揭啰制婆　跋阇啰俱摩唎 俱蓝陀唎　跋阇啰.喝萨多遮
毗地耶.干遮那.摩唎迦　啒苏母.婆羯啰多那　鞞嚧遮那俱唎耶 夜啰菟瑟尼钐
毗折蓝婆.摩尼遮 跋阇啰.迦那迦波啰婆　嚧阇那跋阇啰.顿稚遮 税多遮.迦摩啰
剎奢尸.波啰婆　翳帝夷帝　母陀啰羯拏　娑鞞啰忏　掘梵都　印兔那.么么写

第二会
乌合牛　唎瑟揭拏　般剌舍悉多　萨怛他.伽都瑟尼钐　虎合牛　都卢雍　瞻婆那
虎合牛 都卢雍　悉耽婆那　虎合牛 都卢雍　波啰瑟地耶.三般叉.拏羯啰　虎合牛
都卢雍　萨婆药叉.喝啰剎娑　揭啰诃若阇　毗腾崩.萨那羯啰　虎合牛　都卢雍
者都啰.尸底南　揭啰诃.娑诃萨啰南　毗腾崩.萨那啰　虎合牛　都卢雍　啰叉
婆伽梵　萨怛他.伽都瑟尼钐　波啰点阇吉唎　摩诃娑诃萨啰　勃树娑诃萨啰.
室唎沙　俱知娑诃萨泥帝口隶　阿弊提视婆唎多　咤咤罂迦　摩诃跋阇.嚧陀啰
帝唎菩婆那　曼茶啰　乌合牛　娑悉帝薄婆都　么么　印兔那么么写

第三会
啰阇婆夜　主啰跋夜　阿祇尼婆夜　乌陀迦婆夜　毗沙婆夜　舍萨多啰婆夜
婆啰斫羯啰婆夜　突瑟叉婆夜　阿舍你婆夜　阿迦啰.密唎柱婆夜
陀啰尼部弥剑.波伽波陀婆夜　乌啰迦婆多婆夜　剌阇坛茶婆夜　那伽婆夜
毗条怛婆夜　苏波啰拏婆夜　药叉揭啰诃　啰叉私.揭啰诃　毕唎多.揭啰诃
毘舍遮.揭啰诃　部多揭啰诃　鸠盘茶.揭啰诃　补单那.揭啰诃　迦咤补单那.
揭啰诃　悉干度.揭啰诃　阿播悉摩啰.揭啰诃　乌檀摩陀.揭啰诃　车夜揭啰诃
醯唎婆帝.揭啰诃　社多诃唎南　揭婆诃唎南　嚧地啰.诃唎南　忙娑诃唎南
谜陀诃唎南　摩阇诃唎南　阇多诃唎女　视比多诃唎南　毗多诃唎南
婆多诃唎南　阿输遮.诃唎女　质多诃唎女　帝钐萨鞞钐　萨婆揭啰诃南
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　波唎跋啰者迦.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　茶演尼.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　摩诃般输般怛夜　嚧陀啰.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　那啰夜拏.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　怛埵伽嚧茶西.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　摩诃迦啰.摩怛唎伽拏.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　迦波唎迦.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　阇夜羯啰.摩度羯啰　萨婆啰他娑达那.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　赭咄啰.婆耆你.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　毗唎羊.讫唎知
难陀鸡沙啰.伽拏般帝　索醯夜.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　那揭那.舍啰婆拏.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　阿罗汉.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　毗多啰伽.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　跋阇啰波你 具醯夜.具醯夜　迦地般帝.讫唎担
毗陀夜阇.嗔陀夜弥　鸡啰夜弥　啰叉罔　婆伽梵　印兔那.么么写

第四会
婆伽梵　萨怛多.般怛啰　南无粹都帝　阿悉多.那啰剌迦　波啰婆.悉普咤
毗迦萨怛多.钵帝唎　什佛啰.什佛啰　陀啰陀啰　频陀啰.频陀啰.嗔陀嗔陀
虎合牛　虎合牛　泮咤　泮咤泮咤泮咤泮咤　娑诃　醯醯泮　阿牟迦耶泮
阿波啰提诃多泮　婆啰波啰陀泮　阿素啰.毗陀啰.波迦泮　萨婆提鞞弊泮
萨婆那伽弊泮　萨婆药叉弊泮　萨婆干闼婆弊泮　萨婆补丹那弊泮
迦咤补丹那弊泮　萨婆突狼枳帝弊泮　萨婆突涩比口犁.讫瑟帝弊泮
萨婆什婆唎弊泮　萨婆阿播悉么口犁弊泮　萨婆舍啰婆拏弊泮　萨婆地帝鸡弊泮
萨婆怛摩陀继弊泮　萨婆毗陀耶.啰誓遮口犁弊泮　阇夜羯啰.摩度羯啰
萨婆啰他娑陀鸡弊泮　毗地夜.遮唎弊泮　者都啰.缚耆你弊泮　跋阇啰.俱摩唎
毗陀夜.啰誓弊泮　摩诃波啰丁羊.乂 耆唎弊泮　跋阇啰.商羯啰夜　波啰丈耆.
啰阇耶泮　摩诃迦啰夜　摩诃末怛唎迦拏　南无娑羯唎多夜泮　毖瑟拏婢曳泮
勃啰诃牟尼曳泮　阿耆尼曳泮　摩诃羯唎曳泮　羯啰檀迟曳泮　蔑怛唎曳泮
唠怛唎曳泮　遮文茶曳泮　羯逻啰怛唎曳泮　迦般唎曳泮　阿地目质多.
迦尸摩舍那　婆私你曳泮　演吉质　萨埵婆写　么么印兔那.么么写
第五会
突瑟咤质多　阿末怛唎质多　乌阇诃啰　伽婆诃啰　嚧地啰诃啰　婆娑诃啰
摩阇诃啰　阇多诃啰　视毖多诃啰　跋略夜诃啰　干陀诃啰　布史波诃啰
颇啰诃啰　婆写诃啰　般波质多　突瑟咤质多　唠陀啰质多　药叉揭啰诃
啰剎娑.揭啰诃　闭口隶多.揭啰诃　毗舍遮.揭啰诃　部多揭啰诃
鸠盘茶.揭啰诃　悉干陀.揭啰诃　乌怛摩陀.揭啰诃　车夜揭啰诃
阿播萨摩啰.揭啰诃　宅袪革.茶耆尼.揭啰诃　唎佛帝.揭啰诃　阇弥迦.揭啰诃
舍俱尼.揭啰诃　姥陀啰难地迦.揭啰诃　阿蓝婆.揭啰诃　干度波尼.揭啰诃
什伐啰　堙迦醯迦　坠帝药迦　怛隶帝药迦　者突托迦　尼提.什伐啰
毖钐摩.什伐啰　薄底迦　鼻底迦　室口隶瑟密迦　娑你般帝迦　萨婆什伐啰
室嚧吉帝　末陀鞞达嚧制剑　阿绮嚧钳　目佉嚧钳　羯唎突嚧钳
揭啰诃.揭蓝　羯拏输蓝　惮多输蓝　迄唎夜输蓝　末么输蓝　跋唎室婆输蓝
毖栗瑟咤输蓝　乌陀啰输蓝　羯知输蓝　跋悉帝输蓝　邬嚧输蓝　常伽输蓝
喝悉多输蓝　跋陀输蓝　娑房盎伽.般啰丈伽输蓝　部多毖哆茶　茶耆尼
什婆啰　陀突嚧迦　建咄嚧吉知　婆路多毗　萨般嚧诃凌伽
输沙怛啰　娑那羯啰　毗沙喻迦　阿耆尼.乌陀迦　末啰鞞啰建跢啰
阿迦啰密唎咄.怛敛部迦　地栗剌咤　毖唎瑟质迦　萨婆那俱啰
肆引伽弊.揭啰唎药叉.怛啰刍　末啰视.吠帝钐.娑鞞钐　悉怛多.钵怛啰
摩诃跋阇嚧瑟尼钐　摩诃般赖丈耆蓝　夜波突陀.舍喻阇那　辫怛口隶拏
毗陀耶.盘昙迦嚧弥　帝殊.盘昙迦嚧弥　般啰毘陀.盘昙迦嚧弥　哆侄他
唵　阿那口隶　毘舍提　鞞啰跋阇啰陀唎　盘陀盘陀你　跋阇啰.谤尼泮
虎合牛　都嚧瓮泮　莎婆诃
EOF;
$ar = mb_str_split($str);
echo json_encode(['楞严咒' => $ar], JSON_UNESCAPED_UNICODE);
